Repository: wp-plugins/genesis-enews-extended
Catalog: languages/genesis-enews-extended-*.po
Languages: bg_bg, es_es, sk_sk

source: Displays subscribe form
bg_bg: Показва абонаментна форма
es_es: Muestra formulario de suscripci&#243;n
sk_sk: Zobrazí sa prihlásiť formulár

source: Genesis - eNews Extended
bg_bg: Генезис- електронните новини и актуализации

source: Title
bg_bg: Надпис
es_es: T&#237;tulo
sk_sk: Názov

source: Text To Show Before Form
bg_bg: Текст за показване преди формата

source: Text To Show After Form
bg_bg: Текст за показване след формата

source: Entering your Feedburner ID here will deactivate the custom options below.
bg_bg: Въвеждането на вашия ID Feedburner тук ще деактивира клиентските опции по-долу.
es_es: Al entrar de su Feedburner ID aqu&#237; se desactivar&#224; las opciones debajo.
sk_sk: Zadanie vaše Feedburner ID tu bude deaktivovať vlastné možnosti nižšie.

source: Form Action
bg_bg: Форма за действие
es_es: Acci&#243;n de formulario (Form Action)
sk_sk: Akcia formulára

source: E-Mail Field
bg_bg: Имейл поле
es_es: Campo de Email
sk_sk: Pole e-Mail

source: First Name Field
bg_bg: Собствено име поле
es_es: Campo de Nombre
sk_sk: Krstné meno pole

source: Last Name Field
bg_bg: Фамилно име поле
es_es: Campo de Apellido
sk_sk: Poľa pre priezvisko

source: Hidden Fields
bg_bg: Скрити Полета
es_es: Campos escondidos
sk_sk: Skryté polia

source: Not all services use hidden fields.
bg_bg: Не всички услуги използват скрити полета.
es_es: Todos los servicios no usan campos escondidos.
sk_sk: Nie všetky služby zneužiť skryté polia.

source: Open confirmation page in same window?
bg_bg: Отворете страницата за потвърждение в същия прозорец?
es_es: &#191;Abrir la p&#225;gina de confirmaci&#243;n en la misma ventana?
sk_sk: Otvorené potvrdzovací stránku v rovnakom okne?

source: First Name...
bg_bg: Собствено име...
es_es: Nombre...
sk_sk: Meno…

source: First Name Input Text
bg_bg: Собствено име Въвеждане на текст.
es_es: Nombre de entrada de texto
sk_sk: Meno vstupný textové

source: Last Name...
bg_bg: Фамилно име...
es_es: Apellido...
sk_sk: Priezvisko…

source: Last Name Input Text
bg_bg: Фамилно Име Въвеждане на текст.
es_es: Apellido de entrada de texto
sk_sk: Priezvisko vstupný textové

source: Enter your email address...
bg_bg: Напишете вашия емайл адрес
es_es: Entra su email
sk_sk: Zadajte vašu emailovú adresu...

source: E-Mail Input Text
bg_bg: Имейл въвеждане на текст.
es_es: Email de entrada su texto
sk_sk: e-Mail vstupný textové

source: Go
bg_bg: Отиди
es_es: Ir
sk_sk: Ísť

source: Button Text
bg_bg: Бутон за текст
es_es: Texto de bot&#243;n
sk_sk: Tlačidlo Text
